{
    "education": {
        "university": "Clemson University",
        "endDate": "December 2019",
        "degree": "B.S. in Computer Engineering"
    },
    "experience": [
        {
            "title": "Professional Experience",
            "experience": [
                {
                    "filterableItems": 59376,
                    "location": "Remote",
                    "endDate": "Present",
                    "company": "OpenSponsorship",
                    "role": "Fullstack Software Engineer",
                    "notes": [
                        "Worked on web client built with Angular.JS,  mobile client built with React Native, and Node.JS with MongoDB/RabbitMQ  microservices",
                        "Created notification service to handle sending notifications to email, push, SMS, and Slack",
                        "Redesigned web and mobile deliverable submission system for athletes to submit Social Media posts, files, and analytics",
                        "Helped with training new developers and bringing them up to speed on the company’s platforms and microservices",
                        "Coordinated refactoring of aging Angular.JS architecture to improve developer’s efficiency",
                        "Lead push to optimize performance and improve results of complex ElasticSearch queries and created resources to teach other developers ElasticSearch"
                    ],
                    "startDate": "January 2023"
                },
                {
                    "notes": [
                        "Lead the design and development of client's global OAuth architecture across multiple Salesforce Experience sites creating a single user experience",
                        "Worked with a client to create a developer portal allowing customers to learn and test the client's APIs through their Salesforce Experience site"
                    ],
                    "location": "Charlotte, NC",
                    "startDate": "January 2022",
                    "endDate": "August 2022",
                    "filterableItems": 504,
                    "company": "Persistent Systems",
                    "role": "Senior Software Engineer"
                },
                {
                    "notes": [
                        "Lead the Android development for a client's Xamarin mobile app and released the app to both iOS and Android platforms within 6 months",
                        "Supervised and taught Xamarin and C# to interns throughout their onboarding process",
                        "Coordinated with testers to resolve defects for apps, closing 100+ issues",
                        "Supervised and taught Xamarin and C# to interns throughout their onboarding process",
                        "Responded to user reviews and bug reports, boosting individual ratings by 3.6 stars on average",
                        "Built an in-house desktop app, using JS and Electron, for processing ICRE files improving developers efficiency"
                    ],
                    "endDate": "December 2021",
                    "company": "Fusion360",
                    "filterableItems": 501,
                    "role": "Staff Software Engineer",
                    "startDate": "January 2020",
                    "location": "Charlotte, NC"
                }
            ]
        },
        {
            "experience": [
                {
                    "company": "Clemson University",
                    "role": "Automated Chess Robot",
                    "notes": [
                        "Lead the development of the computer vision system for recognizing the chess pieces and the board",
                        "Worked with one developer to design the system for controlling the motors used to move the grabber, similar to systems used in 3D printers"
                    ],
                    "endDate": "",
                    "location": "",
                    "startDate": "",
                    "filterableItems": 4096,
                    "priority": 1
                },
                {
                    "endDate": "",
                    "notes": [
                        "Built the computer vision system using C++ and OpenCV for an automated nerf gun which allowed it to track and fire at moving targets using multiple fire modes"
                    ],
                    "role": "Computer Vision System for Automated Nerf Toy",
                    "startDate": "",
                    "location": "",
                    "company": "Clemson University",
                    "filterableItems": 4096,
                    "priority": 2
                },
                {
                    "role": "Journaling Mobile App",
                    "location": "",
                    "notes": [
                        "Designed UI and systems to allow users to create new entries based on prompts or create reflections based on previous entries",
                        "Developed the app using Flutter and launched for both iOS and Android",
                        "Utilized Firebase to handle user authentication and data"
                    ],
                    "startDate": "May 2018",
                    "company": "",
                    "endDate": "November 2019",
                    "filterableItems": 2048,
                    "priority": 3
                },
                {
                    "filterableItems": 3,
                    "role": "Game Jams",
                    "endDate": "",
                    "notes": [
                        "<a href=\"https://ldjam.com/events/ludum-dare/54/acid-prototype-racer\">Ludum Dare 54 - Theme: \"Limited Space\"</a> - This game jam was a fun challenge where I created 'Acid Prototype Racer,' a high-speed racing game set in a neon-lit, psychedelic asteroid field. Players navigate a spacecraft through dynamic obstacles. The project emphasized modular design, allowing me to reutilize components for future development. The game was well-received for its vibrant aesthetics and arcade-like gameplay. I'm currently exploring the possibility of further development and refining the game's mechanics for a broader release.",
                        "<a href=\"https://ldjam.com/events/ludum-dare/51/thirsty-vampire\">Ludum Dare 51 - Theme: \" Every 10 Seconds\"</a> - Third game jam overall and the first one I did solo. For this entry, I decided to make a top down game where you played as a vampire who had to suck blood every 10 seconds to stay alive. The twist was that you had to pickpocket your victim and check their blood donor card to ensure they had a compatitible blood type. Overall, I was happy with this game jam and how it turned out. Currently working on a mobile version of the game to release on both Andorid and iOS.",
                        "GMTK 2022 - Theme: \"Roll of the Dice \" - My second game jam and again I was the lead programmer and project lead. This time, we had a group with more writing experience, so we wanted to lean into that with a visual novel that follows a chimp trying to escape a jungle science facility. Unfortunately, we ended up not having enough time so we didn't have as many random encounters and the overall combat was weak.",
                        "<a href=\"https://ldjam.com/events/ludum-dare/50/i-was-reincarnated-as-a-middle-aged-dad-protecting-his-sons-sand-castle\">Ludum Dare 50 - Theme: \"Delay the Inevitable\"</a> - This was my first game jam ever. I was lead programmer and project lead working with a group of friends. We made a tower defense style game where you had to protect your son's sand castle from the ocean until mom returned with the camera."
                    ],
                    "location": "",
                    "startDate": "",
                    "company": "",
                    "priority": 4
                },
                {
                    "notes": [
                        "Developed a bot that utilized Discord's APIs to allow users to play music from YouTube within the server's voice channels via text commands",
                        "Designed web client to allow for easier manipulation of a Discord server's music queue and watch synced music videos in groups"
                    ],
                    "role": "Discord Music Bot",
                    "filterableItems": 1008,
                    "startDate": "",
                    "company": "",
                    "location": "",
                    "endDate": "",
                    "priority": 5
                }
            ],
            "title": "Personal Projects"
        }
    ],
    "id": "krtYPHqlrLLVzPVV9R69",
    "skills": [
        {
            "skills": [
                {
                    "title": "Typescript",
                    "skill": 8
                },
                {
                    "title": "Javascript",
                    "skill": 8
                },
                {
                    "skill": 9,
                    "title": "HTML5"
                },
                {
                    "title": "CSS",
                    "skill": 9
                },
                {
                    "skill": 8,
                    "title": "C#"
                },
                {
                    "title": "Aura",
                    "skill": 3
                },
                {
                    "title": "Apex",
                    "skill": 3
                }
            ],
            "title": "Languages"
        },
        {
            "skills": [
                {
                    "skill": 4,
                    "title": "Xamarin"
                },
                {
                    "title": "Salesforce Lightning",
                    "skill": 6
                },
                {
                    "skill": 8,
                    "title": "Angular"
                },
                {
                    "skill": 7,
                    "title": "React"
                },
                {
                    "title": "Node.js",
                    "skill": 8
                },
                {
                    "skill": 7,
                    "title": "Unity"
                },
                {
                    "skill": 6,
                    "title": "TailwindCSS"
                },
                {
                    "title": "AngularJS",
                    "skill": 8
                },
                {
                    "title": "React Native",
                    "skill": 6
                },
                {
                    "skill": 5,
                    "title": "ElasticSearch"
                }
            ],
            "title": "Frameworks/Tools"
        },
        {
            "skills": [
                {
                    "skill": 8,
                    "title": "Git"
                },
                {
                    "title": "Agile",
                    "skill": 8
                },
                {
                    "title": "Scrum",
                    "skill": 8
                },
                {
                    "skill": 9,
                    "title": "Organization"
                },
                {
                    "title": "Communication",
                    "skill": 7
                }
            ],
            "title": "Other"
        }
    ],
    "contact": {
        "title": "Fullstack Engineer",
        "github": "https://github.com/mcm218/resume-website",
        "email": "mcmuniz218@gmail.com",
        "location": "Charlotte, NC",
        "linkedin": "https://www.linkedin.com/in/michael-muniz-24065b159/",
        "name": "Michael Muñiz",
        "phone": ""
    }
}
